<template>
  <PerfectScrollbar>
    <SendSlider />
    <div
      v-masonry=""
      transition-duration="0.3s"
      item-selector=".item"
      fit-width="true"
      class="mansoryContainer"
    >
      <div v-masonry-tile class="item">
        <SendItem
          :msg="`Далеко-далеко за словесными горами в стране гласных и согласных живут рыбные тексты. Толку пунктуация языкового деревни, жизни он это вдали! Решила, предложения! Ручеек родного силуэт толку по всей прямо инициал знаках страну они запятой. Переписывается решила путь текста безорфографичный, курсивных взгляд приставка? Залетают она всемогущая заголовок первую моей даль меня знаках, щеке текст, о, продолжил грамматики приставка дороге встретил ведущими семантика курсивных. Приставка.`"
        />
      </div>
      <div v-masonry-tile class="item">
        <SendItem
          :msg="`Далеко-далеко за словесными горами в стране гласных и согласных живут рыбные тексты. Толку пунктуация языкового деревни, жизни он это вдали!`"
        />
      </div>
      <div v-masonry-tile class="item">
        <SendItem
          :msg="`Далеко-далеко за словесными горами в стране гласных и согласных живут рыбные тексты. Толку пунктуация языкового деревни, жизни он это вдали! Решила, предложения! Ручеек родного силуэт толку по всей прямо инициал знаках страну они запятой. Переписывается решила путь текста безорфографичный, курсивных взгляд приставка? Залетают она всемогущая заголовок первую моей даль меня знаках, щеке текст, о, продолжил грамматики приставка дороге встретил ведущими семантика курсивных. Приставка.`"
        />
      </div>
      <div v-masonry-tile class="item">
        <SendItem
          :msg="`Далеко-далеко за словесными горами в стране гласных и согласных живут рыбные тексты. Толку пунктуация языкового деревни, жизни он это вдали! `"
        />
      </div>
      <div v-masonry-tile class="item">
        <SendItem
          :msg="`Далеко-далеко за словесными горами в стране гласных и согласных живут рыбные тексты. Толку пунктуация языкового деревни, жизни он это вдали! Решила, предложения! Ручеек родного силуэт толку по всей прямо инициал знаках страну они запятой. Переписывается решила путь текста безорфографичный, курсивных взгляд приставка? Залетают она всемогущая заголовок первую моей даль меня знаках, щеке текст, о, продолжил грамматики приставка дороге встретил ведущими семантика курсивных. Приставка.`"
        />
      </div>
      <div v-masonry-tile class="item">
        <SendItem
          :msg="`Далеко-далеко за словесными горами в стране гласных и согласных живут рыбные тексты. Толку пунктуация языкового деревни, жизни он это вдали!`"
        />
      </div>
      <div v-masonry-tile class="item">
        <SendItem
          :msg="`Далеко-далеко за словесными горами в стране гласных и согласных живут рыбные тексты. Толку пунктуация языкового деревни, жизни он это вдали! Решила, предложения! Ручеек родного силуэт толку по всей прямо инициал знаках страну они запятой. Переписывается решила путь текста безорфографичный, курсивных взгляд приставка? Залетают она всемогущая заголовок первую моей даль меня знаках, щеке текст, о, продолжил грамматики приставка дороге встретил ведущими семантика курсивных. Приставка.`"
        />
      </div>
      <div v-masonry-tile class="item">
        <SendItem
          :msg="`Далеко-далеко за словесными горами в стране гласных и согласных живут рыбные тексты. Толку пунктуация языкового деревни, жизни он это вдали! `"
        />
      </div>
    </div>
  </PerfectScrollbar>
</template>
<script setup>
import SendItem from "@/components/Sends/SendItem.vue";
</script>
<style lang="scss">
.ps {
  padding-top: 150px;
  height: 100vh;
  overflow-y: auto;
  scrollbar-width: none;
  .ps__rail-y {
    margin-top: 150px;
    margin-right: 5px;
    width: 2px;
    background: rgba($color: #fff, $alpha: 0.3);
    border-radius: 0;
    .ps__thumb-y {
      width: 2px;
      background-color: #fff;
      border-radius: 0;
      right: 0;
    }
  }
  .mansoryContainer {
    margin: 0 auto;
  }
}
.ps::-webkit-scrollbar {
  display: none;
}
</style>